In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv("Automobile_data.csv")
data.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

## Checking for null values

In [3]:
data.isnull().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

## Filling null values with mean.

In [4]:
data["price"] = data["price"].fillna(data["price"].mean())

In [5]:
data.isnull().sum().sum()

0

## Most expensive car company name and price

In [6]:
data[["company","price"]][data.price==data["price"].max()]

          company    price
35  mercedes-benz  45400.0

## Details of all Toyota cars.

In [7]:
data[data["company"]=="toyota"]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

## Total cars per company.

In [8]:
data["company"].value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
volkswagen       4
mitsubishi       4
audi             4
mercedes-benz    4
honda            3
isuzu            3
porsche          3
jaguar           3
chevrolet        3
alfa-romero      3
volvo            2
dodge            2
Name: company, dtype: int64

## The car of each company which costs highest among other cars

In [9]:
all_cars = data.groupby("company")

In [10]:
max_price_car_each_company = all_cars["company","price"].max()
max_price_car_each_company

c:\users\nisha\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                     company    price
company
alfa-romero      alfa-romero  16500.0
audi                    audi  18920.0
bmw                      bmw  41315.0
chevrolet          chevrolet   6575.0
dodge                  dodge   6377.0
honda                  honda  12945.0
isuzu                  isuzu  15387.0
jaguar                jaguar  36000.0
mazda                  mazda  18344.0
mercedes-benz  mercedes-benz  45400.0
mitsubishi        mitsubishi   8189.0
nissan                nissan  13499.0
porsche              porsche  37028.0
toyota                toyota  15750.0
volkswagen        volkswagen   9995.0
volvo                  volvo  13415.0

## Car company name with the average mileage providing .

In [12]:
max_price_each_company = all_cars["company","average-mileage"].mean()
max_price_each_company

c:\users\nisha\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

## All companies producing the cars with 'num-of-cylinders'is equal to'six'

In [13]:
data["company"][data["num-of-cylinders"].apply(lambda x: x=="six")].unique()

array(['alfa-romero', 'bmw', 'jaguar', 'nissan', 'porsche', 'toyota'],
      dtype=object)

## All comapnies which are producing the cars with 'average-mileage' greater than or equal to 35 and number of cylinders equal to four.

In [44]:
data["company"][data["num-of-cylinders"].apply(lambda x: x=="four")][data["average-mileage"].apply(lambda x: x>=35)].unique()

array(['chevrolet', 'isuzu', 'mitsubishi', 'nissan', 'toyota',
       'volkswagen'], dtype=object)